#знаходження чисел фібоначі
#це числа, які знаходяться шляхом додавання двох попередніх (0,1,1,2,3,5,8,13,21,34,55...)
#       | 0, n = 1 #якщо число буде 1, результат буде 0
#f(n) = | 1, n = 2 #якщо число буде 2, результат буде 1
#       | f(n-1)+f(n-2) #а в решту випадках, ми будемо користуватись цією формулою
#ми будемо користуватись форулою, тільки якщо число буде більше 2
def fibonacci(n):
	if n==1:#якщо число = 1, ми повертаємо 0
		return 0
	if n==2:#якщо число = 2, ми повертаємо 1
		return 1
	return fibonacci(n-1)+fibonacci(n-2)#а якщо не винонується жодна умова, ми виконуємо формулу

print(fibonacci(5))
print(fibonacci(6))
print(fibonacci(7))

print(fibonacci(70))